{
    "tawheed": [
        {
            "type": "markdown",
            "content": "# Tawheed - Unique Oneness\n*In the name of Allah. Blessings and peace be upon the Messenger of Allah.*\n\nThe core of Muslim belief is **Tawheed** – God's Unique Oneness. It means to declare and to know that Allah is One and Only, without a partner or an equal, and no one else shares in His Godhood. All Prophets from Adam to Muhammad (upon them be blessings and peace) were sent with this unanimous call, declaring that \"there is no god but Allah\" (*laa ilaaha illaLlaah*)."
        },
        {
            "type": "ayah",
            "content": {
                "citation": "Al-Ikhlas [112:1]",
                "verses": [
                    "Say: He is Allah, the One and Only."
                ],
                "audioUrl": "https://cdn.islamic.network/quran/audio/128/ar.husary/6222.mp3"
            }
        },
        {
            "type": "markdown",
            "content": "## Describing God\n\nAllah Most High is not similar to any of His creation. Quran states \"Nothing is like anything resembling Him\" [42:11].  As such, He is beyond our ability to imagine or encompass with intellect. Whatever our imagination draws is not Him. Therefore, when describing Allah, we generally use words from Quran and the sunnah of the Beloved Prophet ﷺ."
        },
        {
            "type": "ayah",
            "content": {
                "citation": "Ash-Shura [42:11]",
                "verses": [
                    "Nothing is like anything resembling Him, and He is the All-hearing, the All-seeing."
                ],
                "audioUrl": "https://nurlingo.github.io/content/hafs/ar.husary/042011003.mp3"
            }
        },
        {
            "type": "markdown",
            "content": "## His beautiful names:\n- Allah is Most Merciful and Compassionate.\n- All-Powerful and All-Knowing, the Creator of the Heavens and Earth.\n- the Living, who does not die, the Everlasting Sustainer of all being.\n- the First without a beginning, the Last without an end.\n- the All-Seeing and All-Hearing, ever accessible through sincere supplication."
        },
        {
            "type": "ayah",
            "content": {
                "citation": "Al-Baqarah [2:163]",
                "verses": [
                    "And your God is one God: There is no god but He, Most Merciful and Compassionate.",
                ],
                "audioUrl": "https://cdn.islamic.network/quran/audio/128/ar.husary/170.mp3"
            }
        },
        {
            "type": "markdown",
            "content": "## He is exalted above any imperfection:\n- He is One, not composed of parts, and Only, for whom there is no second.\n- Self-subsistent, free of need, while everyone is in need of Him.\n- He never gave birth, nor was given birth.\n- He is not like any of His creation, no one even compares to Him.\n- All-High and Supreme, no image of Him can be constructed and no likeness imagined."
        },
        {
            "type": "markdown",
            "content": "## Believing in God is a natural humal instinct\nInterestingly, early Muslim scholars did not focus much on proving God's existence, instead they strived to articulate who God is based on the revelation. Of course, declaring that Allah is One, also means that He exists. Moreover, according to Islam, faith in God is a natural human predisposition (fitrah), and as such should be self-evident to any uncorrupted mind."
        },
        {
            "type": "ayah",
            "content": {
                "citation": "Ibrahim [14:10]",
                "verses": [
                    "Their messengers said, 'Is there any doubt in Allah, the Originator of the heavens and earth?'"
                ],
                "audioUrl": "https://nurlingo.github.io/content/hafs/ar.husary/014010001.mp3"
            }
        },
        {
            "type": "markdown",
            "content": "Yet, later scholars also provided logical proofs for existence of God, which can be roughly summarized as the following: the universe is originated and came out of nothingness, therefore requires an Eternal Creator, who is not dependent on anything to exist."
        },
        {
            "type": "ayah",
            "content": {
                "citation": "Fussilat [41:53]",
                "verses": [
                    "We'll keep showing them our Signs in the utmost limits (of known reality), and in themselves, until it becomes unmistakably plain to them that this is the Truth. Or is your Lord not enough as a witness of everything?"
                ],
                "audioUrl": "https://cdn.islamic.network/quran/audio/128/ar.husary/4271.mp3"
            }
        },
        {
            "type": "markdown",
            "content": "The point of Islam is to recognize your Creator, to submit to Him your will and to worship Him in the best way as taught to the Prophet ﷺ. May Allah make us from the successful, who worship Him alone and no one besides. Blessings and peace be upon the noble Prophet Muhammad and his folk."
        }
    ]
}
