[
    {
        "id": "notifications",
        "titleRu": "Уведомления",
        "descriptionRu": "",
        "titleEn": "Notifications",
        "descriptionEn": "",
        "items": [
            {
                "id": "namaz",
                "showEn": 1,
                "showRu": 1,
                "type": "article",
                "titleEn": "As-salaamu 3alaikum! Welcome to NamazApp.",
                "titleRu": "Ас-саляму 'аляйкум! Добро пожаловать в НамазАпп.",
                "descriptionEn": "Tap here to learn more about NamazApp and prayer in general.",
                "descriptionRu": "Нажмите сюда, чтобы узнать больше о нашем приложении и о намазе в целом.",
                "dateEn": "Mar 01",
                "dateRu": "01.03.23",
                "urlEn": "https://sites.google.com/view/namaz-intro-en",
                "urlRu": "https://sites.google.com/view/namaz-intro-ru",
                "icon": "info.bubble"
            },
            {
                "id": "ashura",
                "showEn": 1,
                "showRu": 1,
                "type": "celebrate",
                "titleEn": "The day of 'Ashura",
                "titleRu": "День 'Ашура",
                "descriptionEn": "Ashura is the tenth day of the blessed month of Muharram, which falls on July 28th this year.\n\nIbn Abbas narrates: The Prophet (ﷺ) came to Medina and saw the Jews fasting on the day of Ashura. He asked them about that. They replied, \"This is a good day, the day on which Allah rescued Bani Israel from their enemy. So, Moses fasted this day.\" The Prophet (ﷺ) said, \"We have more claim over Moses than you.\" So, the Prophet fasted on that day and ordered (the Muslims) to fast (on that day). (Al-Bukhari, Muslim)\n\nTo differentiate from the Jews, the Prophet, peace be upon him, instructed us: \"Fast the day of 'Ashura, and be different from the Jews with regard to it; fast the day before it or the day after it.\" (Ahmad)\n\nTo summarize, it is recommended to fast on the day of Ashura and also a day before or after it, i.e. either on July 27th & 28th OR on July 28th & 29th.",
                "descriptionRu": "День ‘Ашура - это десятый день благословенного месяца Мухаррам, который в этом году выпадает на 28 июля.\n\nИбн ‘Аббас рассказывал: «Когда Пророк, мир ему и благословение Аллаха, прибыл в Медину, он увидел, что иудеи постятся в день ‘Ашура. Тогда он спросил их: 'Что это за день?'. Они ответили: 'Это – благой день, тот день, когда Аллах спас сынов Исраиля от их врага, и поэтому Муса стал соблюдать пост в этот день'. На это Пророк, мир ему и благословение Аллаха, сказал: 'Я имею на Мусу больше прав, чем вы!', после чего стал соблюдать пост в этот день сам и велел делать это всем остальным.» (аль-Бухари, Муслим)\n\nА чтобы отличаться от иудеев, Пророк, мир ему и благословение Аллаха, указал нам: «Поститесь в день ‘Ашура и отличайтесь от иудеев, соблюдая пост за день до него или следующий день» (Ахмад).\n\nПоэтому желательно поститься в этот день и еще день до или после него, т.е. 27 и 28 июля, либо 28 и 29 июля.\n\nНаписано на основе поста на телеграм канале 'Электронный Минбар'",
                "dateEn": "Jul 27",
                "dateRu": "27.07.23",
                "urlEn": "",
                "urlRu": "",
                "icon": "10.square"
            }
        ]
    },
    {
        "id": "news",
        "titleRu": "Новости",
        "descriptionRu": "",
        "titleEn": "What's new",
        "descriptionEn": "",
        "items": [
            {
                "id": "999010",
                "showEn": 1,
                "showRu": 1,
                "type": "audio",
                "titleEn": "Adhan and Iqamah",
                "titleRu": "Азан и Иқамат",
                "descriptionEn": "You can now find Iqamah in the Audios section.\n\nIqamah is the call to prayer that is given after Adhan and right before the prayer starts. It is an emphasized sunnah for men to say the Iqamah before starting a fard prayer.\n\nImportant to mention that it is also recommended to make dua in the period between Adhan and Iqamah, as the Messenger of Allah (ﷺ) said: 'The supplication made between the Adhan and the Iqamah is not rejected.' [Abu Dawud]. In fact, there is a special dua that is made straight after adhan, and we'll inshaAllah add it in the future updates.",
                "descriptionRu": "Во вкладке Аудио теперь можно найти Икамат.\n\nИкамат - это призыв-оповещение о начале намаза, который дают уже после Азана непосредственно перед совершением молитвы. Читать Икамат перед фард намазом - это закрепленная сунна для мужчин.\n\nВажно упомянуть, что рекоммендуется делать дуа в промежуток между азаном и иқаматом. В хадисе говорится: \"Дуа между азаном и иқаматом не будет отвергнуто\" [Абу Дауд]. Есть специальное дуа, которое произноситься после азана. ИншаАллах, его мы добавим в будущих обновлениях.",
                "dateEn": "Aug 7th",
                "dateRu": "07.08.23",
                "urlEn": "",
                "urlRu": "",
                "icon": "megaphone"
            },
            {
                "id": "premium",
                "showEn": 1,
                "showRu": 1,
                "type": "action",
                "titleEn": "Namaz Premium",
                "titleRu": "Намаз Премиум",
                "descriptionEn": "Alhamdulillah, we've launched Premium subscription! It is an opportunity for our users to support NamazApp and get some pleasant perks in return. Even before the subscription, there were already donations in the app, and we regularly received financial support from our users along with kind words, and now we would like to give some small bonuses in return to show our gratitude. The core functionality remains free. We hope this is a well-balanced solution, that should allow us to make the app a sustainable full-time effort, inshaAllah. Please check it out and do become a subscriber if you can afford it. Wa jazakumuLlahu khairan!",
                "descriptionRu": "Альхамдулиллях, мы запустили Намаз Премиум! Премиум подписка - это возможность для наших пользователей поддержать НамазАпп. Важно заметить, что и до подписки в аппе уже были донаты, и мы регулярно получали финансовую поддержку от наших пользователей вместе с добрыми словами, а теперь мы будем давать небольшие бонусы в знак благодарности. Весь основной функционал остается бесплатным: Мы надеемся, что это хорошее решение, которое позволит нам работать над проектом на постоянной основе, иншаАллах.",
                "dateEn": "Jul 12",
                "dateRu": "26.07.23",
                "urlEn": "",
                "urlRu": "",
                "icon": "p.square.fill"
            },
            {
                "id": "youtube",
                "showEn": 1,
                "showRu": 0,
                "type": "settings",
                "titleEn": "Presence in Social Media",
                "titleRu": "Аккаунты в социальных сетях",
                "descriptionEn": "We are activating our social media channels, among them Youtube, Telegram, and Twitter.\n\nWe also released our first video on how actions are classified in Islam. In it, we review how actions are prioritized and what this prioritization means for us.\n\nThe links to all of our accounts can be found in the 'Settings' tab.\n\nMay Allah put benefit into this effort and protect us from the harm of these 'nets'.",
                "descriptionRu": "Мы активизируем наши социальные аккаунты в Ютуб, Телеграм и Твиттер.\n\nПросим у Аллаха, чтобы он вложил в это дело пользу, и защитил нас от зла этих 'сетей'.",
                "dateEn": "Jul 7",
                "dateRu": "07.07.23",
                "urlEn": "",
                "urlRu": "",
                "icon": "network"
            },
            {
                "id": "999007",
                "showEn": 1,
                "showRu": 1,
                "type": "audio",
                "titleEn": "Dua Istikhara",
                "titleRu": "Дуа Истихара",
                "descriptionEn": "We've made dua Istikhara available in the Audios section. Many people where asking about it lately, seems like now is the time a lot of us are making decisions in life. May Allah guide us to the best of things! Ameen!",
                "descriptionRu": "Мы сделали дуа Истихара доступным в разделе Аудио. В последнее время нас часто спрашивали об этом дуа, похоже, что сейчас время когда многие из принимают решения. Да направит нас Аллах к тому, что хорошо для нас! Амин",
                "dateEn": "Jun 20",
                "dateRu": "20.06.23",
                "urlEn": "",
                "urlRu": "",
                "icon": "play.square"
            },
            {
                "id": "prayer_time",
                "showEn": 1,
                "showRu": 1,
                "type": "action",
                "titleEn": "Prayer time functionality",
                "titleRu": "Функционал для времени намаза",
                "descriptionEn": "Alhamdulillah, we have some nice features related to prayer time!\n\nYou can enable and configure the times in the 'Settings' tab, and they will appear on the main page of our app next to each prayer.\n\nYou can also add NamazApp widgets to your home and lock screens, which makes it easier to view the time without too many taps.\n\nDo you want to know how the prayer times are derived? See the corresponding article in the 'Learn' section, called 'Prayer times'.\n\nLastly, we have notifications! If you enable them, you'll receive one for each prayer. A sort of a reminder that can work together with the widgets.\n\nWe actually use and enjoy these features ourselves, and we hope you will find them useful too, inshaAllah!",
                "descriptionRu": "Альхамдулилляh, у нас есть несколько удобных функций, связанных с временем намаза.\n\nСамо время можно включить и настроить на главной страние. После включения, время начала и окончания появится рядом с названием каждого намаза.\n\nСмотреть время намаза можно использую наши виджеты. Есть две вариации виджета для экрана блокировки, и один вариант для основного меню вашего iPhone.\n\nЧтобы понять правила того, как определяется время, читайте статью в разделе «Обучение». Статья так и называется - 'Время намаза'.\n\nИ напоследок, вы можете включить уведомления! Они будут приходить в начале времени каждого намаза.\n\nМы сами пользуемся как виждетами, так и уведомлениями. Надеемся, будет полезно и вам, иншаАллах!",
                "dateEn": "May 25",
                "dateRu": "27.05.23",
                "urlEn": "",
                "urlRu": "",
                "icon": "app.badge"
            },
            {
                "id": "qibla",
                "showEn": 1,
                "showRu": 1,
                "type": "action",
                "titleEn": "Qibla: prayer direction",
                "titleRu": "Кибла: направление намаза",
                "descriptionEn": "Alhamdulillah, we can now find the Qibla direction using the app. Check it out on the main page.\n\nImportant to mention that iPhone's compass is not always 100% accurate. Sometimes it struggles to determine the precise direction you are looking. That's why we've added the map for you to double check by comparing it to your actual surroundings. Take care!",
                "descriptionRu": "Альхамдулиллях, теперь вы можете посмотреть в каком направлении кибла. Опробуйте этот функционал на главной странице.\n\nВажно отметить, что компас iPhone не всегда 100% точен, и иногда он не может определить куда именно повернут телефон. Поэтому у нас есть карта, чтобы вы могли перепроверить, сверив карту со своим окружением.\n\nОбязательно опробуйте, иншаАллах!",
                "dateEn": "May 25",
                "dateRu": "27.05.23",
                "urlEn": "",
                "urlRu": "",
                "icon": "compass.drawing"
            },
            {
                "id": "dark_mode",
                "showEn": 1,
                "showRu": 1,
                "type": "settings",
                "titleEn": "Do you like Dark Mode?",
                "titleRu": "Темный режим",
                "descriptionEn": "Alhamdulillah, now you can disable or enable the Dark Mode. You can find the switch in the 'Settings' tab.\n\nThis feature should make the screen light easier on the eyes inshaAllah. In any case, let's not spend too much time on the phone during the night, and instead get a good sleep after praying Isha.",
                "descriptionRu": "Альхамдулиллях, теперь вы можете включать и отключать ночной переход на темный режим.  Найти настройку можно во вкладке 'Настройки'.\n\nК нам неоднократно писали с этим запросом, и смысл в том, чтобы уменьшить нагрузку на глаза. При этом некоторым нашим пользователям больше нравится белый фон, независимо от времени суток.\n\nКонечно, лучше не смотреть слишком долго в экран ночью, а вместо этого, прочитав Иша, ложиться спать)",
                "dateEn": "Mar 09",
                "dateRu": "09.03.23",
                "urlEn": "",
                "urlRu": "",
                "icon": "lightbulb.circle"
            },
            {
                "id": "namaz",
                "showEn": 1,
                "showRu": 1,
                "type": "article",
                "titleEn": "As-salaamu عalaikum!",
                "titleRu": "Ас-саляму 'аляйкум!",
                "descriptionEn": "Welcome to NamazApp! Our goal is to help you with prayer by supplying all things a beginner needs to get started. Tap on the button below to learn more about NamazApp and prayer in Islam.\n\nIf you have any questions, feel free to message us on WhatsApp.\n\nIf you are at the beginning of your journey, say bismiLlah (in the name of Allah) and proceed. We ask Allah to make things easy and beneficial for you, ameen!",
                "descriptionRu": "Добро пожаловать в НамазАпп. Наша цель - помочь вам встать на намаз, дав вам все самое необходимое чтобы начать. Нажмите на кнопку ниже, чтобы узнать больше о нашем приложении и о намазе в целом.\n\nЕсли у вас вопросы, то пишите нам на Вотсапп без стеснений.\n\nЕсли вы в самом начале пути, то скажите БисмиЛляh (с именем Аллаха) и вставайте на намаз. И пусть Всевышний облегчит вам получения полезных знаний и откроет для вас врата Своей Милости, амин!",
                "dateEn": "Mar 01",
                "dateRu": "01.03.23",
                "urlEn": "https://sites.google.com/view/namaz-intro-en",
                "urlRu": "https://sites.google.com/view/namaz-intro-ru",
                "icon": "info.bubble"
            }
        ]
    },
    {
        "id": "news_navigation",
        "titleRu": "Связь с нами",
        "descriptionRu": "",
        "titleEn": "Contact us",
        "descriptionEn": "",
        "items": [
            {
                "id": "contact_developer",
                "type": "link",
                "urlRu": "https://api.whatsapp.com/send?phone=+77765206766&text=%D0%90%D1%81%D1%81%D0%B0%D0%BB%D1%8F%D0%BC%D1%83%20%27%D0%B0%D0%BB%D1%8F%D0%B9%D0%BA%D1%83%D0%BC%21%20%D0%AF%20%D0%B8%D1%81%D0%BF%D0%BE%D0%BB%D1%8C%D0%B7%D1%83%D1%8E%20%D0%9D%D0%B0%D0%BC%D0%B0%D0%B7%D0%90%D0%BF%D0%BF.",
                "titleRu": "Задать\nвопрос",
                "descriptionRu": "",
                "showRu": 1,
                "urlEn": "https://api.whatsapp.com/send?phone=+77765206766&text=As-salaamu%20%27alaikum!%20I%27m%20using%20NamazApp.%20I%20have%20the%20following%20question%20or%20suggestion:",
                "titleEn": "Ask\na question",
                "descriptionEn": "",
                "showEn": 1,
                "icon": "questionmark.bubble"
            },
            {
                "id": "rate_app",
                "type": "action",
                "titleRu": "Поддержать\nотзывом",
                "descriptionRu": "",
                "showRu": 1,
                "titleEn": "Rate us on\nAppStore",
                "descriptionEn": "Your ratings and reviews will help us reach more people",
                "showEn": 1,
                "icon": "star.square"
            },
            {
                "id": "support_app",
                "type": "action",
                "urlRu": "",
                "titleRu": "Поддержать\nдонатом",
                "descriptionRu": "",
                "showRu": 1,
                "urlEn": "",
                "titleEn": "Become\na supporter",
                "descriptionEn": "",
                "showEn": 1,
                "icon": "heart.fill"
            },
            {
                "id": "share_app",
                "type": "action",
                "descriptionRu": "",
                "titleRu": "Поделиться\nссылкой",
                "showRu": 1,
                "titleEn": "Share\nthe link",
                "descriptionEn": "",
                "showEn": 1,
                "icon": "square.and.arrow.up"
            },
            {
                "id": "personalization",
                "type": "action",
                "titleRu": "Рассказать\nо себе",
                "descriptionRu": "",
                "showRu": 1,
                "titleEn": "Tell about\nyourself",
                "descriptionEn": "",
                "showEn": 1,
                "icon": "person.text.rectangle"
            }
        ]
    }
]
