[
    {
        "id": "3idul-fitr-23",
        "showEn": 1,
        "showRu": 1,
        "type": "celebrate",
        "titleEn": "Eid Mubarak and good news",
        "titleRu": "'Ид Мубарак и хорошие новости",
        "descriptionEn": "Dear brothers and sisters, we congratulate you with Eid al-Fitr! May Allah Almighty accept from us and from you, and bring us all to the next Ramadan in a good state pleasing to Him!\n\nAlhamdulillah, during this amazing month, we've had half a million active users from over 150 countries! This is an incredible result, and we praise Allah Almighty for granting it to us. We would also like to thank you our dear users for using the app, supporting us, and giving suggestions on how to improve it. May Almighty Allah make grant us all beneficial knowledge and good deeds, and make us sincere thankful slaves of His! Ameen!",
        "descriptionRu": "Дорогие братья и сестры, поздравляем вас с праздником Ураза-Байрам!  Да примет Аллах от нас и от вас, и доведет нас всех до следующего Рамадана!\n\nАльхамдулиллях, за этот благословенный месяц нашим аппом воспользовалось полмиллиона людей из более чем 150 стран! Для нас это просто невероятный результат, и мы благодарим Всевышнего Аллаха за такое благословение в нашем деле. Мы также хотим сказать сердечное спасибо вам, что пользуетесь нашим аппом, поддерживаете и даете ценные советы по улучшению. Пусть Всевышний Аллах дарует нам всем полезных знаний, искренности, и хороших дел!",
        "dateEn": "Apr 21",
        "dateRu": "21.04.23",
        "urlEn": "",
        "urlRu": "",
        "image": "party.popper"
    },
    {
        "id": "laylatul-qadr",
        "showEn": 1,
        "showRu": 1,
        "type": "celebrate",
        "titleEn": "Laylatul Qadr",
        "titleRu": "Ляйлятуль-Кадр",
        "descriptionEn": "The last 10 days of Radaman have arrived. Among them is a night that is worth more than 1000 months! It's called Laylatul-Qadr (the Night of Divine Decree), and you can read more about at the Ramadan section of the Learn tab.",
        "descriptionRu": "Наступили последние 10 дней Рамадана. Среди них есть особенная ночь, которая лучше чем 1000 месяцев! Эта ночь называется Ляйлятуль-Кадр (Ночь предопределения). Узнайте больше прочитав статью в разделе Обучение.",
        "dateEn": "Apr 11",
        "dateRu": "11.04.23",
        "urlEn": "",
        "urlRu": "",
        "image": "moon.stars"
    },
    {
        "id": "prayer_times",
        "showEn": 1,
        "showRu": 1,
        "type": "celebrate",
        "titleEn": "Prayer times",
        "titleRu": "Время намаза",
        "descriptionEn": "Enable prayer times in the 'More' tab, and they will appear on the main page next to each prayer. You can then add our widgets to your iPhone's lock screen and menu.\n\nWe also have an article about prayer times in the 'Learn' section. Definitely give it a read!",
        "descriptionRu": "Время намаза можно включить во вкладке «Разное», и оно появится на главной странице. После включения можно добавлять виджеты на экран блокировки и меню вашего iPhone.\n\nА в разделе «Обучение» у нас новая статья о том, как мы определяем время каждого намаза. Обязательно посмотрите!",
        "dateEn": "Apr 6",
        "dateRu": "06.04.23",
        "urlEn": "",
        "urlRu": "",
        "image": "clock.badge"
    },
    {
        "id": "short_surah",
        "showEn": 1,
        "showRu": 1,
        "type": "celebrate",
        "titleEn": "Choice between surahs",
        "titleRu": "Выбор между сурами",
        "descriptionEn": "You can now choose between surahs al-Kauthar and al-Kafiroon in the first rak'ah of obligatory prayers. InshaAllah, this should make memorizing easier for beginners.",
        "descriptionRu": "Теперь вы сможете выбирать между сурами аль-Кяусар и аль-Кафирун в первом ракате обязательных намазов. ИншаАллах, это облегчит запоминание для начинающих.",
        "dateEn": "Mar 31",
        "dateRu": "31.03.23",
        "urlEn": "",
        "urlRu": "",
        "image": "dots.and.line.vertical.and.cursorarrow.rectangle"
    },
    {
        "id": "ramadan",
        "showEn": 1,
        "showRu": 1,
        "type": "celebrate",
        "titleEn": "Ramadan Mubarak!",
        "titleRu": "Рамадан Мубарак!",
        "descriptionEn": "The best month has arrived! We have a section on Ramadan in the Learn tab. Check it out!\n\nBonus: Tap here to get access to a free course on the basics of fasting.",
        "descriptionRu": "Наконец наступил самый лучший месяц в году! Обязательно почитайте про Рамадан на главной странице. А в разделе 'Обучение' есть короткая статья про таравих намаз.",
        "dateEn": "Mar 22",
        "dateRu": "23.03.23",
        "urlEn": "",
        "urlRu": "",
        "image": "moon"
    },
    {
        "id": "dark_mode",
        "showEn": 1,
        "showRu": 1,
        "type": "celebrate",
        "titleEn": "Do you like Dark Mode?",
        "titleRu": "Темный режим - можно выбирать",
        "descriptionEn": "Alhamdulillah, now you can disable or enable the Dark Mode. Find the switch in the 'More' tab.",
        "descriptionRu": "Альхамдулиллях, теперь вы может включать и отключать переход на темный режим во время ночи. Найти настройку можно во вкладке 'Разное'.",
        "dateEn": "Mar 09",
        "dateRu": "09.03.23",
        "urlEn": "",
        "urlRu": "",
        "image": "lightbulb.circle"
    },
    {
        "id": "namaz",
        "showEn": 1,
        "showRu": 1,
        "type": "article",
        "titleEn": "About Namaz",
        "titleRu": "О намазе",
        "descriptionEn": "As-salaamu عalaikum and welcome to NamazApp! Tap here to learn more about NamazApp and prayer in Islam.",
        "descriptionRu": "Ас-саляму 'аляйкум! Добро пожаловать в НамазАпп. Нажмите сюда, чтобы узнать больше о нашем приложении и о намазе в целом.",
        "dateEn": "Mar 01",
        "dateRu": "01.03.23",
        "urlEn": "https://sites.google.com/view/namaz-intro-en",
        "urlRu": "https://sites.google.com/view/namaz-intro-ru",
        "image": "info.bubble"
    }
]
